# MEPSpaceConstruction Properties

---
The MEPSpaceConstruction type exposes the following members.
| Name| Description
---|---|---
| CurrentConstruction| Get all the Building Constructions according to the specific Construction type.
| SpaceConstructions| Return all the Space constructions of current space.
Top
#### Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace